Tekla Open API Reference for Tekla Structures 2025
ComponentInput.AddInputObjects Method
 Adds an array list of model objects to the component input.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddInputObjects(
	ArrayList Objects
)
Public Function AddInputObjects (
	Objects As ArrayList
) As Boolean
Parameters
Objects
Type: System.Collections.ArrayList
A list of model objects in the correct order.
Return Value
Type: Boolean
True on success.
See Also
Reference
ComponentInput Class
Tekla.Structures.Model Namespace